local db = require('dashboard')

db.default_executive = 'telescope'

db.custom_header = {
    [[ ███╗   ██╗ ███████╗ ██████╗  ██╗   ██╗ ██╗ ███╗   ███╗]],
    [[ ████╗  ██║ ██╔════╝██╔═══██╗ ██║   ██║ ██║ ████╗ ████║]],
    [[ ██╔██╗ ██║ █████╗  ██║   ██║ ██║   ██║ ██║ ██╔████╔██║]],
    [[ ██║╚██╗██║ ██╔══╝  ██║   ██║ ╚██╗ ██╔╝ ██║ ██║╚██╔╝██║]],
    [[ ██║ ╚████║ ███████╗╚██████╔╝  ╚████╔╝  ██║ ██║ ╚═╝ ██║]],
    [[ ╚═╝  ╚═══╝ ╚══════╝ ╚═════╝    ╚═══╝   ╚═╝ ╚═╝     ╚═╝]],
}

db.custom_center = {
    {desc = "Find Files            ", action = "Telescope find_files", shortcut = "SPC f f", icon = "🔎 "},
    {desc = "Open Man              ", action = "Telescope man_pages", shortcut = "SPC m  ", icon = "📖 "},
}
db.custom_footer = { '"The thing about street fights? The street always wins." - Dom, Furious 7' }
